package com.javaex.practice;

public class Ex05 {
	public static void main(String[] args) {
		/*
		
		자바소스파일(~. j ava) 을 작성할 때 틀린것을 찾아 수정해보세요
			(1) 패키지명은 일반적으로 가독성을 위해 대문자 , 소문자 섞어 사용한다
			    - 패키지명은 일반적으로 소문자로 작성하며, 단어가 여러 개일 경우 언더스코어(_)를 사용하거나 점(.)으로 구분합니다.
			    
			(2) 클래스명은 소문자로만 구성하여 작성한다
			    - 클래스명은 대문자로 시작하며, 각 단어의 첫 글자를 대문자로 작성하는 '카멜 케이스(CamelCase)'를 사용합니다.
			    
			(3) 자바소스파일 (~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용 해야된다
				- 자바 소스파일 이름과 클래스 이름은 대소문자를 포함하여 동일해야 합니다
				
			(4) 실행문 뒤 문자의 끝 에는 반드시 ( : 콜론을 사용해야 한다
			 	- 실행문 뒤에는 콜론(:)이 필요하지 않습니다. 자바에서는 세미콜론(;)을 사용하여 문장을 종료합니다.
			 	
			(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다
				- 자바에서 처음으로 실행되는 메서드는 main 메서드여야 하며, 그 이름은 변경할 수 없습니다.
				  public static void main(String[] args) 형식으로 작성해야 합니다.
		
		*/
		
	}
}
